Northen-Light/stm32-bare-metal-flash-driver/src/flash.c
#include <stdbool.h>

#include "flash.h"
#include "spi.h"
#include "stm32f103xx.h"
#include "flash_internal.h"

static void flash_select(void);
static void flash_deselect(void);
static void flash_write_enable(void);
static bool flash_is_wel_set(void);
static void flash_wait_while_busy(void);
static void flash_send_address(uint32_t address);

void flash_init(void) {
  GPIOA_CRL &= ~GPIOA_CRL_PIN4_MASK;
  GPIOA_CRL |= GPIOA_CRL_PIN4_GP_PP_10MHZ;
}

void flash_read_jedec_id(jedec_id_t *id) {
  flash_wait_while_busy();

  flash_select();
  spi1_transfer(FLASH_CMD_JEDEC_ID);
  id -> manufacturer_id = spi1_transfer(FLASH_DUMMY_BYTE);
  id -> memory_type = spi1_transfer(FLASH_DUMMY_BYTE);
  id -> capacity = spi1_transfer(FLASH_DUMMY_BYTE);
  flash_deselect();
}

void flash_read_data(uint32_t length, uint32_t address, uint8_t *out_buffer) {
  flash_wait_while_busy();

  flash_select();
  spi1_transfer(FLASH_CMD_READ_DATA);
  flash_send_address(address);

  for (uint32_t index = 0; index < length; index++) {
    out_buffer[index] = spi1_transfer(FLASH_DUMMY_BYTE);
  }

  flash_deselect();
}

flash_status_t flash_page_program(uint32_t length, uint8_t *in_buffer, uint32_t address) {
  flash_wait_while_busy();

  flash_write_enable();

  if (!flash_is_wel_set()) {
    return FLASH_STATUS_WEL_NOT_SET;
  }

  flash_select();
  spi1_transfer(FLASH_CMD_PAGE_PROGRAM);
  flash_send_address(address);

  for (uint32_t index = 0; index < length; index++) {
    spi1_transfer(in_buffer[index]);
  }

  flash_deselect();

  return FLASH_STATUS_OK;
}

flash_status_t flash_sector_erase(uint32_t address) {
  flash_wait_while_busy();

  flash_write_enable();
  
  if (!flash_is_wel_set()) {
    return FLASH_STATUS_WEL_NOT_SET;
  }

  flash_select();
  spi1_transfer(FLASH_CMD_SECTOR_ERASE);
  flash_send_address(address);
  flash_deselect();

  return FLASH_STATUS_OK;
}

flash_status_t flash_chip_erase(void) {
  flash_wait_while_busy();

  flash_write_enable();
  
  if (!flash_is_wel_set()) {
    return FLASH_STATUS_WEL_NOT_SET;
  }

  flash_select();
  spi1_transfer(FLASH_CMD_CHIP_ERASE);
  flash_deselect();

  return FLASH_STATUS_OK;
}

static void flash_select(void) {
  GPIOA_BSRR = GPIOA_BSRR_PIN4_RESET;
}

static void flash_deselect(void) {
  GPIOA_BSRR = GPIOA_BSRR_PIN4_SET;
}

static void flash_write_enable(void) {
  flash_select();
  spi1_transfer(FLASH_CMD_WRITE_ENABLE);
  flash_deselect();
}

static bool flash_is_wel_set(void) {
  uint8_t status;

  flash_select();
  spi1_transfer(FLASH_CMD_READ_REGISTER1);
  status = spi1_transfer(FLASH_DUMMY_BYTE); 
  flash_deselect();

  return ((status & FLASH_STATUS_REGISTER1_WEL_BIT) != 0);
}

static void flash_wait_while_busy(void) {
  uint8_t status;

  flash_select();
  spi1_transfer(FLASH_CMD_READ_REGISTER1);
  
  do {
    status = spi1_transfer(FLASH_DUMMY_BYTE);
  } while ((status & FLASH_STATUS_REGISTER1_BUSY_BIT) != 0);

  flash_deselect();
}

static void flash_send_address(uint32_t address) {
  spi1_transfer((address >> 0) & 0xFF);
  spi1_transfer((address >> 8) & 0xFF);
  spi1_transfer((address >> 16) & 0xFF);
}